tests/cassettes/webservice/rms/test_inventory/test_rms_inventory.yaml

interactions:
- request:
    body: "<?xml version='1.0' encoding='utf-8'?>\n<soap-env:Envelope xmlns:soap-env=\"\
      http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap-env:Body>\n    <ns0:getInventoryExternal\
      \ xmlns:ns0=\"https://inventoryapi.rms.rakuten.co.jp/rms/mall/inventoryapi\"\
      >\n      <ns0:externalUserAuthModel>\n        <ns1:authKey xmlns:ns1=\"java:jp.co.rakuten.rms.mall.inventoryapi.v1.model.entity\"\
      >ESA XXXXXX<>/ns1:authKey>\n        <ns2:userName xmlns:ns2=\"java:jp.co.rakuten.rms.mall.inventoryapi.v1.model.entity\"\
      ></ns2:userName>\n        <ns3:shopUrl xmlns:ns3=\"java:jp.co.rakuten.rms.mall.inventoryapi.v1.model.entity\"\
      <shopUrl>XXXXXX</shopUrl>/ns3:shopUrl>\n      </ns0:externalUserAuthModel>\n\
      \      <ns0:getRequestExternalModel>\n        <ns4:inventorySearchRange xmlns:ns4=\"\
      java:jp.co.rakuten.rms.mall.inventoryapi.v1.model.entity\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\
      \ xsi:nil=\"true\"/>\n        <ns5:itemUrl xmlns:ns5=\"java:jp.co.rakuten.rms.mall.inventoryapi.v1.model.entity\"\
      \ xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:nil=\"true\"/>\n\
      \      </ns0:getRequestExternalModel>\n    </ns0:getInventoryExternal>\n  </soap-env:Body>\n\
      </soap-env:Envelope>\n"
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['1188']
      Content-Type: [text/xml; charset=utf-8]
      SOAPAction: ['""']
      User-Agent: [python-requests/2.12.4]
    method: POST
    uri: https://api.rms.rakuten.co.jp/es/1.0/inventory/ws
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAA6VSP2sbMRT/Kka7Jd9lKcJ3gQTTBuqlXboK38tZju7pkOSzb3SzdiyEQCAQMrR7
        phDyZQ7irxHJtlKHQFroIqT3fn/eHw0Pl5XqNWCs1JiRhA5ID3CiC4llRubutP+B9KwTWAilETLS
        giWH+RCw4SNsQOkael4CLbda1J6akalzNWfMTqZQCUt9NqSoNiULFxb1Gdkxl7Z4YS0WC7o42IDT
        wSBh38afv26EItg7/4vFtrQ9C/l3i77E0OoEyLbBTyAKMGz7ONJFmw8rXoI78erotGlHSwcGhfoC
        ttZo4ySqrZX1XjJCRS2pqSw14mzuAOlE01nNfIRVQqlXOO+OCTdg58rtFDH5T8mok2ZkJhrBZ3WA
        R2ZQCRz6SrtJaKULUNSHpGu9hpXctbX/BZjyj+Bi23EM44AO1accjDn2r3yUJv10kAzZXmyXH4O1
        ooT86fZqfXfTff/Vnf/uzh+61Y/15f3653W3uuhWj5vzOvIjJ0iUbws4cVBtqkSpMuLMHIjfHnuZ
        pr+/v0AP+LNrtv/J82eIZBU6KgMAAA==
    headers:
      Connection: [close]
      Content-Encoding: [gzip]
      Content-Length: ['421']
      Content-Type: [text/xml; charset=utf-8]
      Date: ['Fri, 23 Dec 2016 09:19:37 GMT']
      Server: [nginx]
      Vary: [Accept-Encoding]
      requestId: [eefb9f2a-b341-4e10-afb2-8ed796e871f2]
      timeStamp: ['2016-12-23T09:19:37']
    status: {code: 200, message: OK}
version: 1
